app/controllers/productos_controller.rb

SELECT * FROM "productos" LIMIT 10 OFFSET 0
SELECT count(*) AS count_all FROM "productos"
---
  def index
    @productos = Producto.paginate :page => params[:pagina]

INSERT INTO "productos" ("detalle", "imagen", "created_at", "habilitado", "imagen_content_type", "updated_at", "precio", "imagen_file_name", "imagen_file_size", "imagen_updated_at", "operacion_id", "modelo", "categoria_id") VALUES(NULL, NULL, '2010-03-04 01:47:17', NULL, NULL, '2010-03-04 01:47:17', NULL, NULL, NULL, NULL, NULL, '', 1)
---
  def create
    @producto = Producto.new(params[:producto])
    if @producto.save

SELECT * FROM "productos" WHERE ("productos"."id" = 3)
---
  def edit
    @producto = Producto.find(params[:id])

SELECT * FROM "productos" WHERE ("productos"."id" = 1)
DELETE FROM "productos" WHERE "id" = 1
---
  def destroy
    @producto = Producto.find(params[:id])
    if @producto.destroy